package by.epam.unit_4.task10;

/*
task10: Создать класс Airline, спецификация которой приведена ниже. Определить конструкторы, set- и get- методы и
метод toString(). Создать второй класс, агрегирующий массив типа Airline, с подходящими конструкторами и методами.
Задать критерии выбора данных и вывести эти данные на консоль.

    Airline: пункт назначения, номер рейса, тип самолета, время вылета, дни недели.
    Найти и вывести:
    a) список рейсов для заданного пункта назначения;
    b) список рейсов для заданного дня недели;
    c) список рейсов для заданного дня недели, время вылета которых больше заданного.
 */

import java.time.LocalTime;

public class Solution {
    public static void main(String[] args) {
    }
}
